//=================================================================================================
/// @file       myIPC.h
///
/// @brief      Datei enthält Variablen und Funktionen um das IPC-Modul (Inter Processor
///							Communication) des Mikrocontrollers  TMS320F2838x zu konfigurieren um
///						 	Kommunikation zwischen CPU 1 und CPU 2 zu ermöglichen.
///
/// @version    V1.0
///
/// @date       19.09.2022
///
/// @author     Daniel Urbaneck
//=================================================================================================
#ifndef MYIPC_H_
#define MYIPC_H_
//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include "myDevice.h"


//-------------------------------------------------------------------------------------------------
// Defines
//-------------------------------------------------------------------------------------------------


//-------------------------------------------------------------------------------------------------
// Macros
//-------------------------------------------------------------------------------------------------


//-------------------------------------------------------------------------------------------------
// Global variables
//-------------------------------------------------------------------------------------------------
// Speichert die von CPU 2 empfangenen Daten
extern uint32_t ipcDataFromCPU2;

//-------------------------------------------------------------------------------------------------
// Prototypes of global functions
//-------------------------------------------------------------------------------------------------
// Funktion initialisiert das IPC-Modul
extern void IpcInit(void);
// Funktion sendet Daten an CPU 2
extern void IpcSendDataToCpu2(uint32_t data);
// Interrupt-Service-Routine für die Inter-Processor-Communication (IPC)
__interrupt void IPC0ISR(void);


#endif

